Autodesk.Revit.DB.LinkedFileStatus
Enum displaying the loaded status of a linked file
Since:
2012

Autodesk.Revit.DB.LinkedFileStatus.LocallyUnloaded
The linked file is unloaded for the specific user.
(If the linked file is both unloaded for the specific user
and unloaded for all users, the link will report LinkedFileStatus.Unloaded.)

Autodesk.Revit.DB.LinkedFileStatus.InClosedWorkset
The linked file is in a closed workset and will not be displayed.

Autodesk.Revit.DB.LinkedFileStatus.CanBeUpgraded
The linked point cloud file is obsolete and can be indexed into new format.

Autodesk.Revit.DB.LinkedFileStatus.NotFound
The linked file was not able to be found the
last time Revit tried to load it.

Autodesk.Revit.DB.LinkedFileStatus.Imported
The element represented by this value was imported
into Revit rather than linked into Revit.

Autodesk.Revit.DB.LinkedFileStatus.Unloaded
The link is unloaded.

Autodesk.Revit.DB.LinkedFileStatus.Loaded
The link is loaded.

Autodesk.Revit.DB.LinkedFileStatus.Invalid
This value is the uninitialized value for the enum.
It indicates that the link has not been properly
initialized.